       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACTUALIZADOR.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT LOG-FILE ASSIGN TO '/app/accounts/TRANSACTIONS.LOG'
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  LOG-FILE.
       01  LOG-RECORD PIC X(50).
       PROCEDURE DIVISION.
           OPEN EXTEND LOG-FILE
           STRING "Transaccion completada a las " FUNCTION CURRENT-DATE
               DELIMITED BY SIZE INTO LOG-RECORD
           END-STRING
           WRITE LOG-RECORD
           CLOSE LOG-FILE
           DISPLAY "LOG ACTUALIZADO"
           STOP RUN.
