       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT JOURNAL-FILE
               ASSIGN TO "accounts/JOURNAL.LOG"
               ORGANIZATION IS LINE SEQUENTIAL
               FILE STATUS IS WS-JOURNAL-STATUS.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WS-JOURNAL-STATUS PIC XX.
